In [1]:
import pandas as pd
from sklearn.preprocessing import StandardScaler, MinMaxScaler
df = pd.read_csv('loan_data_set.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [2]:
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [3]:
# standardization
numeric_cols=['ApplicantIncome','CoapplicantIncome','LoanAmount']
scaler = StandardScaler()
stand_df = pd.DataFrame(scaler.fit_transform(df[numeric_cols]), columns=[numeric_cols])

In [4]:
s_result_df = pd.DataFrame()
for col in numeric_cols:
  s_result_df[col] = df[col]
  s_result_df[f"Standard_{col}"] = stand_df[col]

In [5]:
s_result_df.head().head()

,ApplicantIncome,Standard_ApplicantIncome,CoapplicantIncome,Standard_CoapplicantIncome,LoanAmount,Standard_LoanAmount
0,5849,0.072991,0.0,-0.554487,NaN,NaN
1,4583,-0.134412,1508.0,-0.038732,128.0,-0.215309
2,3000,-0.393747,0.0,-0.554487,66.0,-0.940328
3,2583,-0.462062,2358.0,0.251980,120.0,-0.308860
4,6000,0.097728,0.0,-0.554487,141.0,-0.063289

In [6]:
s_result_df.describe()

,ApplicantIncome,Standard_ApplicantIncome,CoapplicantIncome,Standard_CoapplicantIncome,LoanAmount,Standard_LoanAmount
count,614.000000,6.140000e+02,614.000000,6.140000e+02,592.000000,5.920000e+02
mean,5403.459283,-4.339634e-18,1621.245798,4.050325e-17,146.412162,-3.000603e-18
std,6109.041673,1.000815e+00,2926.248369,1.000815e+00,85.587325,1.000846e+00
min,150.000000,-8.606493e-01,0.000000,-5.544873e-01,9.000000,-1.606878e+00
25%,2877.500000,-4.138159e-01,0.000000,-5.544873e-01,100.000000,-5.427370e-01
50%,3812.500000,-2.606393e-01,1188.500000,-1.480047e-01,128.000000,-2.153091e-01
75%,5795.000000,6.414426e-02,2297.250000,2.312023e-01,168.000000,2.524450e-01
max,81000.000000,1.238462e+01,41667.000000,1.369617e+01,700.000000,6.473575e+00

In [7]:
# normalization
scaler = MinMaxScaler()
norm_df = pd.DataFrame(scaler.fit_transform(df[numeric_cols]), columns=[numeric_cols])

In [8]:
n_result_df = pd.DataFrame()
for col in numeric_cols:
  n_result_df[col] = df[col]
  n_result_df[f"Normalized_{col}"] = norm_df[col]
n_result_df.head()

,ApplicantIncome,Normalized_ApplicantIncome,CoapplicantIncome,Normalized_CoapplicantIncome,LoanAmount,Normalized_LoanAmount
0,5849,0.070489,0.0,0.000000,NaN,NaN
1,4583,0.054830,1508.0,0.036192,128.0,0.172214
2,3000,0.035250,0.0,0.000000,66.0,0.082489
3,2583,0.030093,2358.0,0.056592,120.0,0.160637
4,6000,0.072356,0.0,0.000000,141.0,0.191027

In [9]:
n_result_df.describe()

,ApplicantIncome,Normalized_ApplicantIncome,CoapplicantIncome,Normalized_CoapplicantIncome,LoanAmount,Normalized_LoanAmount
count,614.000000,614.000000,614.000000,614.000000,592.000000,592.000000
mean,5403.459283,0.064978,1621.245798,0.038910,146.412162,0.198860
std,6109.041673,0.075560,2926.248369,0.070229,85.587325,0.123860
min,150.000000,0.000000,0.000000,0.000000,9.000000,0.000000
25%,2877.500000,0.033735,0.000000,0.000000,100.000000,0.131693
50%,3812.500000,0.045300,1188.500000,0.028524,128.000000,0.172214
75%,5795.000000,0.069821,2297.250000,0.055134,168.000000,0.230101
max,81000.000000,1.000000,41667.000000,1.000000,700.000000,1.000000

In [10]:
encoded_df = pd.get_dummies(df['Property_Area'], columns=['Property_Area'])
for index, row in encoded_df.iterrows():
    encoded_df.at[index, 'Encoded_Property_Area'] = f"{row['Rural']}{row['Semiurban']}{row['Urban']}"
encoded_df.drop(['Rural','Semiurban','Urban'],axis=1,inplace=True)
encoded_df['Property_Area'] = df['Property_Area']
encoded_df.tail()

    Encoded_Property_Area Property_Area
609        TrueFalseFalse         Rural
610        TrueFalseFalse         Rural
611        FalseFalseTrue         Urban
612        FalseFalseTrue         Urban
613        FalseTrueFalse     Semiurban